app/Filters/AuthFilter.php

SELECT *
FROM `user`
WHERE `username` = 'defa'
---

        $role_id = $session->get('role_id');

        // ================= AMBIL USER =================
        $user = $db->table('user')
            ->getWhere([
                'username' => $session->get('username')
            ])
            ->getRowArray();

SELECT *
FROM `user_menu`
WHERE `controllers` = 'dashboard'
---
            substr(strrchr($controller, '\\'), 1)
        );

        // ================= CARI MENU =================
        $queryMenu = $db->table('user_menu')
            ->where('controllers', $controller)
            ->get()
            ->getRowArray();

SELECT *
FROM `user_access_menu`
WHERE `role_id` = '1'
AND `menu_id` = '1'
---

        $menu_id = $queryMenu['id'];

        // ================= CEK HAK AKSES =================
        $userAccess = $db->table('user_access_menu')
            ->getWhere([
                'role_id' => $role_id,
                'menu_id' => $menu_id
            ])
            ->getNumRows();