app/Controllers/Administrator.php

    public function getMenu($id)
    {
        $akses = $this->db->table('user_access_menu')
            ->where('role_id',$id)
            ->get()->getResultArray();
---
SELECT *
FROM `user_access_menu`
WHERE `role_id` = '1'

    public function menu()
    {
        $data = [
            'title' => 'Kelola Menu',
            'user'  => $this->menuData['user'],

            // 🔥 GANTI NAMA!
            'menuList' => $this->db->table('user_menu')
                ->select('*')
                ->orderBy('urutan', 'ASC')
                ->get()
                ->getResultArray()
---
SELECT *
FROM `user_menu`
ORDER BY `urutan` ASC

    public function role()
    {
        helper(['form', 'url']);
        $validation = \Config\Services::validation();

        $user = $this->menuData['user'];

        if ($this->request->getMethod() === 'post') {

            if (!$this->validate(['role' => 'required'])) {
                return redirect()->back()->withInput();
            }

            $this->db->table('user_role')->insert([
                'role' => esc($this->request->getPost('role'))
            ]);

            return redirect()->to('/administrator/akses')
                ->with('message', '<b>Role berhasil ditambahkan</b>');
        }

        $data = [
            'title' => 'Peran & Hak Akses',
            'user'  => $user,
            'validation' => $validation,

            'allMenus' => $this->db->table('user_menu')->orderBy('id', 'ASC')->get()->getResultArray(),

            'userRole' => $this->db->table('user_role r')
                ->select('r.*, COUNT(u.id) as total_user')
                ->join('user u', 'u.role_id = r.id', 'left')
                ->groupBy('r.id')
                ->get()->getResultArray()
---
SELECT *
FROM `user_menu`
ORDER BY `id` ASC
SELECT `r`.*, COUNT(u.id) as total_user
FROM `user_role` `r`
LEFT JOIN `user` `u` ON `u`.`role_id` = `r`.`id`
GROUP BY `r`.`id`

    public function edit($id)
    {
        // update nama role
        $this->db->table('user_role')
            ->where('id', $id)
            ->update([
                'role' => $this->request->getPost('role')
            ]);

        // 🔥 hapus akses lama
        $this->db->table('user_access_menu')
            ->where('role_id', $id)
            ->delete();

        // 🔥 insert ulang akses baru
        $menus = $this->request->getPost('menu_id');

        if ($menus) {
            foreach ($menus as $menu_id) {
                $this->db->table('user_access_menu')->insert([
                    'role_id' => $id,
                    'menu_id' => $menu_id
                ]);
---
UPDATE `user_role` SET `role` = 'Administrator'
WHERE `id` = '1'
DELETE FROM `user_access_menu`
WHERE `role_id` = '1'
INSERT INTO `user_access_menu` (`role_id`, `menu_id`) VALUES ('1', '1')