app/Controllers/Dashboard.php

    public function index()
    {
        $validation = \Config\Services::validation();
        $user = $this->menuData['user'];

        $data = [
            'title' => 'Dashboard',
            'validation' => $validation,

            'userTamu' => $this->db->table('tamu')
                ->where('codeTamu', $user['username'])
                ->get()
                ->getRowArray(),

            'roles' => $this->db->table('user_role')->get()->getResultArray(),

            'userRole' => $this->db->table('user_role')->get()->getResultArray(),
---
SELECT *
FROM `tamu`
WHERE `codeTamu` = 'defa'
SELECT *
FROM `user_role`


        // ================= SOCIAL MEDIA =================

        $data['social_media'] = $this->db->table('social_media')
            ->orderBy('id', 'DESC')
            ->get()
            ->getResultArray();

        // ================= ROLE USER =================

        $data['userRoleStats'] = $this->db->table('user_role ur')
            ->select('ur.id, ur.role, COUNT(u.id) as total')
            ->join('user u', 'u.role_id = ur.id', 'left')
            ->groupBy('ur.id')
            ->orderBy('ur.id', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `social_media`
ORDER BY `id` DESC
SELECT `ur`.`id`, `ur`.`role`, COUNT(u.id) as total
FROM `user_role` `ur`
LEFT JOIN `user` `u` ON `u`.`role_id` = `ur`.`id`
GROUP BY `ur`.`id`
ORDER BY `ur`.`id` ASC

    public function testimoniChart()
    {
        $data = [
            'title' => 'Diagram Testimoni',
        ];

        // ================= TOTAL KEPUASAN =================

        $data['kepuasanChart'] = $this->db->table('testimonies_detail')
            ->select("
                kepuasan,
                COUNT(*) as total
            ")
            ->groupBy('kepuasan')
            ->orderBy('kepuasan', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `kepuasan`, COUNT(*) as total
FROM `testimonies_detail`
GROUP BY `kepuasan`
ORDER BY `kepuasan` ASC