app/Controllers/MainController.php

SELECT *
FROM `settings`
---
    public function initController($request, $response, $logger)
    {
        parent::initController($request, $response, $logger);

        // 🔥 INIT DB DULU (WAJIB)
        $this->db = \Config\Database::connect();

        // 🔥 COUNT VISITOR
        $this->countVisitor();

        $this->checkAccess();

        // 🔥 SETTINGS
        $settings = $this->db->table('settings')->get()->getResultArray();

SELECT *
FROM `user`
WHERE `username` = 'defa'
---
    protected function loadMenu()
    {
        $session = session();

        if (!$session->get('username')) return;

        $user = $this->db->table('user')
            ->where('username', $session->get('username'))
            ->get()
            ->getRowArray();

SELECT *
FROM `user_role`
---
            ->get()
            ->getResultArray();

        $userRole = $this->db->table('user_role')
            ->get()
            ->getResultArray();

SELECT *
FROM `user`
WHERE `username` = 'defa'
---
    protected function checkAccess()
    {
        $router = service('router');
        $controller = strtolower(class_basename($router->controllerName()));

        // contoh:
        // Dashboard → dashboard

        // bypass public
        if (in_array($controller, ['tamu', 'login'])) {
            return;
        }

        $session = session();

        if (!$session->get('username')) return;

        $user = $this->db->table('user')
            ->where('username', $session->get('username'))
            ->get()
            ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `visitors`
WHERE `visit_date` = '2026-05-08'
SELECT COUNT(*) AS `numrows`
FROM `visitors`
WHERE `visit_date` >= '2026-05-01'
AND `visit_date` <= '2026-05-31'
SELECT COUNT(*) AS `numrows`
FROM `visitors`
WHERE `visit_date` >= '2026-01-01'
AND `visit_date` <= '2026-12-31'
SELECT COUNT(*) AS `numrows` FROM `visitors`
---
    protected function getVisitorStats()
    {
        $today = date('Y-m-d');

        $startMonth = date('Y-m-01');
        $endMonth   = date('Y-m-t');

        $startYear = date('Y-01-01');
        $endYear   = date('Y-12-31');

        return [

            // HARI INI
            'today' => $this->db->table('visitors')
                ->where('visit_date', $today)
                ->countAllResults(),

            // BULAN INI
            'month' => $this->db->table('visitors')
                ->where('visit_date >=', $startMonth)
                ->where('visit_date <=', $endMonth)
                ->countAllResults(),

            // TAHUN INI
            'year' => $this->db->table('visitors')
                ->where('visit_date >=', $startYear)
                ->where('visit_date <=', $endYear)
                ->countAllResults(),

            // TOTAL
            'total' => $this->db->table('visitors')
                ->countAll(),

SELECT MONTH(visit_date) as bulan, YEAR(visit_date) as tahun, COUNT(*) as total
FROM `visitors`
GROUP BY YEAR(visit_date), MONTH(visit_date)
ORDER BY `tahun` ASC, `bulan` ASC
---
    public function getVisitorChart()
    {
        return $this->db->table('visitors')
            ->select("
                MONTH(visit_date) as bulan,
                YEAR(visit_date) as tahun,
                COUNT(*) as total
            ")
            ->groupBy("YEAR(visit_date), MONTH(visit_date)")
            ->orderBy('tahun', 'ASC')
            ->orderBy('bulan', 'ASC')
            ->get()
            ->getResultArray();

SELECT YEAR(visit_date) as tahun, COUNT(*) as total
FROM `visitors`
GROUP BY YEAR(visit_date)
ORDER BY `tahun` ASC
---
    public function getVisitorYearChart()
    {
        return $this->db->table('visitors')
            ->select("
                YEAR(visit_date) as tahun,
                COUNT(*) as total
            ")
            ->groupBy("YEAR(visit_date)")
            ->orderBy('tahun', 'ASC')
            ->get()
            ->getResultArray();