app/Models/SimataModel.php

SELECT *
FROM `tamu`
WHERE `statusTamu` = 0
AND `tanggalBerkunjung` >= '2026-05-08'
AND `ditemui` = '146'
---
    public function tamu($ditemui)
    {
        return $this->db->table('tamu')
            ->where('statusTamu', 0)
            ->where('tanggalBerkunjung >=', date('Y-m-d'))
            ->where('ditemui', $ditemui)
            ->get()
            ->getResultArray();

SELECT *
FROM `tamu`
WHERE `statusTamu` = 0
AND `tanggalBerkunjung` >= '2026-05-08'
---
    public function tamuAll()
    {
        return $this->db->table('tamu')
            ->where('statusTamu', 0)
            ->where('tanggalBerkunjung >=', date('Y-m-d'))
            ->get()
            ->getResultArray();

SELECT COUNT(*) as total
FROM `tamu`
WHERE YEAR(tanggalBerkunjung) = '2026'
AND MONTH(tanggalBerkunjung) = 1
AND `statusTamu` = 1
---
    public function chartBulanan($bulan)
    {
        return $this->db->table('tamu')
            ->select('COUNT(*) as total')
            ->where('YEAR(tanggalBerkunjung)', date('Y'))
            ->where('MONTH(tanggalBerkunjung)', $bulan)
            ->where('statusTamu', 1)
            ->get()
            ->getRowArray();

SELECT COUNT(*) as total
FROM `tamu`
WHERE YEAR(tanggalBerkunjung) = '2026'
AND MONTH(tanggalBerkunjung) = '05'
AND `statusTamu` = 0
---
    public function statusTamu($id)
    {
        return $this->db->table('tamu')
            ->select('COUNT(*) as total')
            ->where('YEAR(tanggalBerkunjung)', date('Y'))
            ->where('MONTH(tanggalBerkunjung)', date('m'))
            ->where('statusTamu', $id)
            ->get()
            ->getRowArray();

SELECT COUNT(*) as total
FROM `tamu`
WHERE `statusTamu` = 0
AND `tanggalBerkunjung` >= '2026-05-08'
AND `ditemui` = 'Administrator'
---
    public function banyakTamuBaru($ditemui)
    {
        return $this->db->table('tamu')
            ->select('COUNT(*) as total')
            ->where('statusTamu', 0)
            ->where('tanggalBerkunjung >=', date('Y-m-d'))
            ->where('ditemui', $ditemui)
            ->get()
            ->getRowArray();

SELECT COUNT(*) as total
FROM `tamu`
WHERE `statusTamu` = 0
AND `tanggalBerkunjung` >= '2026-05-08'
---
    public function banyakTamuBaruAll()
    {
        return $this->db->table('tamu')
            ->select('COUNT(*) as total')
            ->where('statusTamu', 0)
            ->where('tanggalBerkunjung >=', date('Y-m-d'))
            ->get()
            ->getRowArray();

SELECT COUNT(*) as total
FROM `tamu`
WHERE `statusTamu` = 0
AND `tanggalBerkunjung` = '2026-05-08'
AND `diwakilkan` = 'Administrator'
---
    public function banyakTamuDiwakilkan($ditemui)
    {
        return $this->db->table('tamu')
            ->select('COUNT(*) as total')
            ->where('statusTamu', 0)
            ->where('tanggalBerkunjung', date('Y-m-d'))
            ->where('diwakilkan', $ditemui)
            ->get()
            ->getRowArray();

SELECT COUNT(*) as total
FROM `tamu`
WHERE `tanggalBerkunjung` = '2026-05-08'
AND `statusTamu` = 1
---
    public function tamuHariIni($status)
    {
        return $this->db->table('tamu')
            ->select('COUNT(*) as total')
            ->where('tanggalBerkunjung', date('Y-m-d'))
            ->where('statusTamu', $status)
            ->get()
            ->getRowArray();

SELECT COUNT(*) as total
FROM `tamu`
WHERE `tanggalBerkunjung` = '2026-05-08'
---
    public function tamuHariIniBaru()
    {
        return $this->db->table('tamu')
            ->select('COUNT(*) as total')
            ->where('tanggalBerkunjung', date('Y-m-d'))
            ->get()
            ->getRowArray();

SELECT *
FROM `tamu`
WHERE `tanggalBerkunjung` = '2026-05-08'
ORDER BY `id` DESC
---
    public function BanyakTamuHariIni()
    {
        return $this->db->table('tamu')
            ->where('tanggalBerkunjung', date('Y-m-d'))
            ->orderBy('id', 'DESC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) as total
FROM `tamu`
WHERE YEAR(tanggalBerkunjung) = '2026'
---
    public function BanyakTamuTahunIni()
    {
        return $this->db->table('tamu')
            ->select('COUNT(*) as total')
            ->where('YEAR(tanggalBerkunjung)', date('Y'))
            ->get()
            ->getRowArray();

SELECT COUNT(*) as total
FROM `tamu`
WHERE MONTH(tanggalBerkunjung) = '05'
---
    public function BanyakTamuBulanIni()
    {
        return $this->db->table('tamu')
            ->select('COUNT(*) as total')
            ->where('MONTH(tanggalBerkunjung)', date('m'))
            ->get()
            ->getRowArray();

SELECT COUNT(*) as total
FROM `user`
WHERE `role_id` = 1
---
    public function banyakRole($id)
    {
        return $this->db->table('user')
            ->select('COUNT(*) as total')
            ->where('role_id', $id)
            ->get()
            ->getRowArray();

SELECT `user`.*, `user_role`.`role`, `user_role`.`icon`, `user_role`.`color`
FROM `user`
JOIN `user_role` ON `user`.`role_id` = `user_role`.`id`
---
    public function usersMAs()
    {
        return $this->db->table('user')
            ->select('user.*, user_role.role, user_role.icon, user_role.color')
            ->join('user_role', 'user.role_id = user_role.id')
            ->get()
            ->getResultArray();

SELECT COUNT(CASE WHEN kepuasan = 1 THEN 1 END) AS sangat_puas, COUNT(CASE WHEN kepuasan = 2 THEN 1 END) AS puas, COUNT(CASE WHEN kepuasan = 3 THEN 1 END) AS cukup, COUNT(CASE WHEN kepuasan = 4 THEN 1 END) AS kurang
FROM `testimonies_detail`
---
    public function kepuasanSurvey()
    {
        return $this->db->table('testimonies_detail')
            ->select("
                COUNT(CASE WHEN kepuasan = 1 THEN 1 END) AS sangat_puas,
                COUNT(CASE WHEN kepuasan = 2 THEN 1 END) AS puas,
                COUNT(CASE WHEN kepuasan = 3 THEN 1 END) AS cukup,
                COUNT(CASE WHEN kepuasan = 4 THEN 1 END) AS kurang
            ")
            ->get()
            ->getRowArray();

SELECT COUNT(CASE WHEN kepuasan = 1 THEN 1 END) AS sangat_puas, COUNT(CASE WHEN kepuasan = 2 THEN 1 END) AS puas, COUNT(CASE WHEN kepuasan = 3 THEN 1 END) AS cukup, COUNT(CASE WHEN kepuasan = 4 THEN 1 END) AS kurang
FROM `testimonies_detail`
WHERE YEAR(tanggal) = 2024
---
    public function get_survey_by_year($year)
    {
        return $this->db->table('testimonies_detail')
            ->select("
                COUNT(CASE WHEN kepuasan = 1 THEN 1 END) AS sangat_puas,
                COUNT(CASE WHEN kepuasan = 2 THEN 1 END) AS puas,
                COUNT(CASE WHEN kepuasan = 3 THEN 1 END) AS cukup,
                COUNT(CASE WHEN kepuasan = 4 THEN 1 END) AS kurang
            ")
            ->where('YEAR(tanggal)', $year)
            ->get()
            ->getRowArray();